artillery_tests/write-heavy-test.yml
config:
  target: "http://127.0.0.1:8001"
  environments:
    fastapi-sync:
      target: "http://127.0.0.1:8001"
    fastapi-async:
      target: "http://127.0.0.1:8002"
    express:
      target: "http://127.0.0.1:3000"
  phases:
    - duration: 180
      arrivalRate: 20
      name: "Write operations"
  ensure:
    maxErrorRate: 1
  plugins:
    metrics-by-endpoint: {}
    expect: {}
    http: {}


scenarios:
  - name: "write_operations"
    flow:
      - post:
          url: "/items/"
          json:
            name: "Test Item {{ $randomNumber(1, 1000) }}"
            description: "Description for test item {{ $randomNumber(1, 1000) }}"
          capture:
            - json: "$.item_id"
              as: "itemId"
          expect:
            - statusCode: 200
      - think: 1
      - put:
          url: "/items/{{ itemId }}"
          json:
            name: "Updated Item {{ $randomNumber(1, 1000) }}"
            description: "Updated description {{ $randomNumber(1, 1000) }}"
          expect:
            - statusCode: 200
      - think: 1